In [1]:
%load_ext sql

In [2]:
%sql mysql+pymysql://root:SecureP%40sw0rd%21123@localhost:3306/company_data

In [3]:
%%sql
SELECT
	*
FROM
	Company_employees;

 * mysql+pymysql://root:***@localhost:3306/company_data
5 rows affected.

[('E001', 'Carmel', 'J01', 'Chef', 26, 'Cape Town'),
 ('E001', 'Carmel', 'J02', 'Waiter', 26, 'Cape Town'),
 ('E002', 'Stefanie', 'J02', 'Waiter', 56, 'Joburg'),
 ('E002', 'Stefanie', 'J03', 'Bartender', 56, 'Joburg'),
 ('E003', 'Lisa', 'J01', 'Chef', 5, 'Nairobi')]

In [8]:
%%sql

CREATE TABLE Employees (primary key (Employee_id)) AS
SELECT DISTINCT Employee_id, Name, State_code, Home_state
FROM Company_employees

 * mysql+pymysql://root:***@localhost:3306/company_data
3 rows affected.

[]

In [9]:
%%sql

SELECT * FROM Employees;

 * mysql+pymysql://root:***@localhost:3306/company_data
3 rows affected.

[('E001', 'Carmel', 26, 'Cape Town'),
 ('E002', 'Stefanie', 56, 'Joburg'),
 ('E003', 'Lisa', 5, 'Nairobi')]

In [11]:
%%sql

CREATE TABLE Jobs (primary key (Job_code)) AS
SELECT DISTINCT Job_code, Job_title
FROM Company_employees

 * mysql+pymysql://root:***@localhost:3306/company_data
(pymysql.err.OperationalError) (1050, "Table 'Jobs' already exists")
[SQL: CREATE TABLE Jobs (primary key (Job_code)) AS
SELECT DISTINCT Job_code, Job_title
FROM Company_employees]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

In [12]:
%%sql

SELECT * FROM Jobs

 * mysql+pymysql://root:***@localhost:3306/company_data
3 rows affected.

[('J01', 'Chef'), ('J02', 'Waiter'), ('J03', 'Bartender')]

In [13]:
%%sql 

CREATE TABLE Employee_roles (PRIMARY KEY(Employee_id, Job_code)) AS 
SELECT Employee_id , Job_code
FROM Company_employees

 * mysql+pymysql://root:***@localhost:3306/company_data
5 rows affected.

[]

In [14]:
%%sql
SELECT * FROM Employee_roles;

 * mysql+pymysql://root:***@localhost:3306/company_data
5 rows affected.

[('E001', 'J01'),
 ('E001', 'J02'),
 ('E002', 'J02'),
 ('E002', 'J03'),
 ('E003', 'J01')]